Public Attributes | List of all members
API_SFill_Arc Struct Reference
Attribute Management
Describes an arc item in a symbol fill. More...
#include <APIdefs_Attributes.h>
 Public Attributes
 API_Coord  | begC
The beginning coordinate of the arc item in the symbol fill.
 API_Coord  | origC
The origin of the arc item in the symbol fill. The distance of the origin and the beginning coordinate defines the radius of the arc.
 double  | angle
The angle of the arc item in the symbol fill, measured CCW.
Detailed Description
Describes an arc item in a symbol fill.
Since
Archicad 6.5
Remarks
The drawing below illustrates the meaning of the fields.
 Symbolic arc